Revit 2027 API
ExportLayerTable.GetExportLayerInfo Method
 Gets a copy of the layer info associated to the input pattern key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLayerInfo GetExportLayerInfo(
	ExportLayerKey exportLayerKey
)
Public Function GetExportLayerInfo (
	exportLayerKey As ExportLayerKey
) As ExportLayerInfo
public:
ExportLayerInfo^ GetExportLayerInfo(
	ExportLayerKey^ exportLayerKey
)
member GetExportLayerInfo :
        exportLayerKey : ExportLayerKey -> ExportLayerInfo
Parameters
exportLayerKey ExportLayerKey
 The export layer Key.
Return Value
ExportLayerInfo
 Return the layerInfo for this key.
Exceptions
Exception | Condition
ArgumentException |  An entry with the given key is not present in the table.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace